other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_1/simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    runTime;

writeInterval   500;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
			forceCoeffs1
	{
	    type            forceCoeffs;
        libs ( "libforces.so" );
        writeControl   timeStep;
        writeInterval  1;
        patches         (bladenlf26_bladenlf26 bladenlf26_bladenlf26FLAP);
        rho             rhoInf;
        log             true;
        rhoInf          1.177;
        liftDir         (-0.1045 0.9945 0);
        dragDir         (0.9945 0.1045 0);
        CofR            (0.25 0 0);
        pitchAxis       (0 0 1);
        magUInf         41.869;
        lRef           0.94;
        Aref           0.1;
	}

	yPlus1
	{
	type yPlus;
	libs ( "libfieldFunctionObjects.so" );
         writeControl   timeStep;
         writeInterval  500;
	}
	
	//#includeFunc	residuals;	

};


// ************************************************************************* //
